run/atmBoundary/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    floor
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          200;
        startFace       11200;
    }
    ceiling
    {
        type            patch;
        nFaces          200;
        startFace       11400;
    }
    inlet
    {
        type            cyclic;
        inGroups        List<word> 1(cyclic);
        nFaces          400;
        startFace       11600;
        matchTolerance  0.0001;
        neighbourPatch  outlet;
        transformType   translational;
        separation      (0 -500 0);
    }
    outlet
    {
        type            cyclic;
        inGroups        List<word> 1(cyclic);
        nFaces          400;
        startFace       12000;
        matchTolerance  0.0001;
        neighbourPatch  inlet;
        transformType   translational;
        separation      (0 500 0);
    }
    leftBoundary
    {
        type            cyclic;
        inGroups        List<word> 1(cyclic);
        nFaces          200;
        startFace       12400;
        matchTolerance  0.0001;
        neighbourPatch  rightBoundary;
        transformType   translational;
        separation      (-500 0 0);
    }
    rightBoundary
    {
        type            cyclic;
        inGroups        List<word> 1(cyclic);
        nFaces          200;
        startFace       12600;
        matchTolerance  0.0001;
        neighbourPatch  leftBoundary;
        transformType   translational;
        separation      (500 0 0);
    }
)

// ************************************************************************* //
